namespace VKRServer.Models
{
    public static class C
    {
        public static readonly string[] Name = {"Иванов", "Петров", "Сидоров", "Смирнов", "Кузнецов",
                                                "Васильев", "Попов", "Соколов", "Михайлов", "Новиков",
                                                "Фёдоров", "Морозов", "Волков", "Алексеев", "Лебедев",
                                                "Семёнов", "Егоров", "Павлов", "Козлов", "Степанов",
                                                "Николаев", "Орлов", "Андреев", "Макаров", "Никитин",
                                                "Захаров", "Зайцев", "Соловьёв", "Борисов", "Яковлев",
                                                "Григорьев", "Романов", "Воробьёв", "Сергеев", "Кузьмин",
                                                "Фролов", "Александров", "Дмитриев", "Королёв", "Гусев",
                                                "Киселёв", "Ильин", "Максимов", "Поляков", "Сорокин",
                                                "Виноградов", "Ковалёв", "Белов", "Медведев", "Антонов",
                                                "Иванова", "Петрова", "Сидорова", "Смирнова", "Кузнецова",
                                                "Васильева", "Попова", "Соколова", "Михайлова", "Новикова",
                                                "Фёдорова", "Морозова", "Волкова", "Алексеева", "Лебедева",
                                                "Семёнова", "Егорова", "Павлова", "Козлова", "Степанова",
                                                "Николаева", "Орлова", "Андреева", "Макарова", "Никитина",
                                                "Захарова", "Зайцева", "Соловьёва", "Борисова", "Яковлева",
                                                "Григорьева", "Романова", "Воробьёва", "Сергеева", "Кузьмина",
                                                "Фролова", "Александрова", "Дмитриева", "Королёва", "Гусева",
                                                "Киселёва", "Ильина", "Максимова", "Полякова", "Сорокина",
                                                "Виноградова", "Ковалёва", "Белова", "Медведева", "Антонова"
                                               };

        public static readonly int[] Schedule =  { 60 * 09 + 15, 60 * 10 + 50,
                                                   60 * 12 + 25, 60 * 14 + 25,
                                                   60 * 16 + 05, 60 * 17 + 40,
                                                   60 * 19 + 05, 60 * 20 + 30
                                                };
        public const int TimeOfDelay = 20;
        public const int TimeOut = 31000;
        public const int TimeZone = 3;
        public const int ID = 100000;
        public const int Delay = 20;
        public const int Error = 10;
        public const int CC = 36;
        public const int LPD = 4;
    }
}
